rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]
---
  def same_director
     @movie = Movie.find params[:id]
     director = @movie.director
     if director.empty? or director.nil?
       flash[:notice] = "'#{@movie.title}' has no director info."
       redirect_to movies_path
     end
     @movies = Movie.where(director: director)